<img src="img/viu_logo.png" width="200">

## Curso 03EPPY Bases de Datos.

<img src="img/logos.png" width="460">

Profesor: *Liliana Gavidia Ceballos*

## SQL (Lenguaje Estructurado de Consulta).

- **SQL** es un lenguaje sencillo, versátil y poderoso, que permite crear, consultar y manipular datos y estructuras en una base de datos. También puede definirse como un lenguaje que permite especificar consultas en una base de datos relacional.

## Instalar la librería ipython-SQL.
Autor: Catherine Devlin, http://catherinedevlin.blogspot.com
- [ipython-sql ](https://pypi.org/project/ipython-sql/ )
    - Instalación: *pip install ipython-SQL* 
    
- Permite usar la **misma sintaxis de comandos** del lenguaje de consulta **SQL** dentro de un cuaderno de Jupyter Notebook.
    - Consultas SQL que ocupan una sola línea:   Anteponer símbolo **%** 
    - Consultas SQL que ocupan más de una línea: Anteponer símbolo **%%**

- Esto gracias al uso del ORM **SQL Alchemy**.

NOTA: Esta librería por alguna razón no funciona bien para la versión 3.9.4.  
Se recomienda descargar desde la pagina de python el ejecutable para instalar la versión 3.9.6.  
Al ejecutarla, seleccionar la opción "upgrade now" y con ello se completa la actualización.

## Al abrir el cuaderno Jupyter Notebook:

- Cargar la extensión SQL. 

- Cargar base de datos en el cuaderno Jupyter Notebook.
    - El fichero de base de datos debe estar en el mismo directorio desde el cual se ejecuta el cuaderno.
    - Si no existe, creará una base de datos vacía.

In [1]:
 import os
 
 %reload_ext sql 
 
 dbname = 'flights.db'
 if os.path.exists(dbname): os.unlink(dbname)

 %sql sqlite:///flights.db

'Connected: @flights.db'

## Lenguaje de Definición de Datos (DDL)

Es utilizado en la definición del schema, lo que permite definir cómo se estructuran los datos en una base de datos relacional. Los comandos asociados a la definición del schema son: CREATE, ALTER y DROP.

## CREATE(DATABASE, TABLE, ROLE, VIEW)

- `CREATE TABLE nombre_tabla (  
     nombre_columna1 tipo_variable,  
     nombre_columna2 tipo_variable,  
     nombre_columna3 tipo_variable,  
     nombre_columna4 tipo_variable  
)`

In [2]:
%%sql
DROP TABLE IF EXISTS vuelos;

 * sqlite:///flights.db
Done.

[]

In [4]:
%%sql sqlite:// 

CREATE TABLE vuelos (
    id_vuelo SERIAL AUTO INCREMENT,  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

Done.

[]

## Visualizar estructura de tabla creada

In [5]:
%sql PRAGMA table_info(vuelos)

 * sqlite:///flights.db
Done.

[(0, 'id_vuelo', 'SERIAL AUTO INCREMENT', 0, None, 0),
 (1, 'origen', 'VARCHAR', 1, None, 0),
 (2, 'destino', 'VARCHAR', 1, None, 0),
 (3, 'hora_salida', 'TEXT', 0, None, 0),
 (4, 'hora_llegada', 'TEXT', 0, None, 0),
 (5, 'aerolinea', 'VARCHAR', 1, None, 0)]

## Modificar la Estructura de una Tabla

## Añadir Columna a una Tabla

- `ALTER TABLE nombre_tabla  
     ADD COLUMN nombre_columna tipo_variable`

In [6]:
%%sql
ALTER TABLE vuelos
    ADD COLUMN fecha_vuelo TIMESTAMP

 * sqlite:///flights.db
Done.

[]

In [7]:
%sql PRAGMA TABLE_info(vuelos)

 * sqlite:///flights.db
Done.

[(0, 'id_vuelo', 'SERIAL AUTO INCREMENT', 0, None, 0),
 (1, 'origen', 'VARCHAR', 1, None, 0),
 (2, 'destino', 'VARCHAR', 1, None, 0),
 (3, 'hora_salida', 'TEXT', 0, None, 0),
 (4, 'hora_llegada', 'TEXT', 0, None, 0),
 (5, 'aerolinea', 'VARCHAR', 1, None, 0),
 (6, 'fecha_vuelo', 'TIMESTAMP', 0, None, 0)]

## Eliminar Columna de una Tabla

- `ALTER TABLE nombre-tabla  
     DROP COLUMN nombre-columna`

In [8]:
%%sql
ALTER TABLE vuelos
    DROP COLUMN fecha_vuelo

 * sqlite:///flights.db
Done.

[]

In [9]:
%sql PRAGMA TABLE_INFO(vuelos)

 * sqlite:///flights.db
Done.

[(0, 'id_vuelo', 'SERIAL AUTO INCREMENT', 0, None, 0),
 (1, 'origen', 'VARCHAR', 1, None, 0),
 (2, 'destino', 'VARCHAR', 1, None, 0),
 (3, 'hora_salida', 'TEXT', 0, None, 0),
 (4, 'hora_llegada', 'TEXT', 0, None, 0),
 (5, 'aerolinea', 'VARCHAR', 1, None, 0)]

## Eliminar una Tabla

- `DROP TABLE nombre_tabla`

- `DROP TABLE vuelos`

## Eliminar una Base de Datos

- `DROP DATABASE nombre_basedatos`

- `DROP DATABASE flights`

## Lenguaje de Manipulación de Datos (DML)

Es el usado en las consultas y modificación de los datos. Los comandos asociados a la manipulación de datos son: SELECT, INSERT, UPDATE, y DELETE.

- `SELECT  
    nombre_columna1,  
    nombre_columna2,  
     ...  
    nombre_columnaN  
    FROM nombre_tabla`

In [10]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[]

## Lenguaje de Consulta o Manipulación de Datos (DML) : SELECT

In [11]:
%sql SELECT id_vuelo, aerolinea FROM vuelos

 * sqlite:///flights.db
Done.

[]

In [10]:
%%sql SELECT id_vuelo, aerolinea FROM vuelos
    WHERE origen='caracas'
    AND destino='madrid'

 * sqlite:///flights.db
Done.

[]

## Lenguaje de Consulta o Manipulación de Datos (DML) : INSERT

- `INSERT INTO nombre_tabla(var1, var2, ...)  
     VALUES (data1, data2, ...)`

In [12]:
%%sql
INSERT INTO vuelos (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea)
    VALUES ('IB6674', 'caracas', 'madrid', '16:50', '10:15', 'swiss')

 * sqlite:///flights.db
1 rows affected.

[]

In [13]:
%%sql
INSERT INTO vuelos (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa')

 * sqlite:///flights.db
2 rows affected.

[]

In [14]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[('IB6674', 'caracas', 'madrid', '16:50', '10:15', 'swiss'),
 ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
 ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa')]

## Lenguaje de Consulta o Manipulación de Datos (DML) : UPDATE

- `UPDATE nombre_tabla SET  
     nombre_columna=nuevo_valor  
     WHERE alguna_condicion`

- Supongamos que en el registro del vuelo en la tabla vuelos se cometió un error en los campos aerolínea y hora-salida para el vuelo IB6674.
Si solo queremos corregir el error en la aerolínea:

In [15]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[('IB6674', 'caracas', 'madrid', '16:50', '10:15', 'swiss'),
 ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
 ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa')]

In [16]:
%%sql
UPDATE vuelos SET
    aerolinea='iberia'
    WHERE id_vuelo='IB6674'

 * sqlite:///flights.db
1 rows affected.

[]

In [17]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[('IB6674', 'caracas', 'madrid', '16:50', '10:15', 'iberia'),
 ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
 ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa')]

- Si queremos corregir ambos errores en una misma línea de comandos:

In [18]:
%%sql
UPDATE vuelos SET
    aerolinea='iberia',hora_salida='19:50' 
    WHERE id_vuelo='IB6674'

 * sqlite:///flights.db
1 rows affected.

[]

- Muy importante observar el uso de la cláusula WHERE en el comando UPDATE.
- De lo contrario, el cambio se realizaría sobre todos los registros de la tabla.

In [19]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
 ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
 ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa')]

## Lenguaje de Consulta o Manipulación de Datos (DML): DELETE

- `DELETE FROM nombre_tabla`

In [20]:
%sql DELETE FROM vuelos

 * sqlite:///flights.db
3 rows affected.

[]

In [21]:
%sql SELECT * FROM vuelos

 * sqlite:///flights.db
Done.

[]

Eliminación de registros de una tabla que cumplen una determinada condición:

In [ ]:
%sql DELETE FROM vuelos WHERE id_vuelo='IB6674'

In [ ]:
%sql select * from vuelos

## Lenguaje de Control de Datos (DCL)

- Lenguaje de Control de Datos (DCL): se utiliza para proveer seguridad de la base de datos en un - ambiente multiusuarios.
- Específicamente se usa para otorgar o revocar privilegios a un usuario sobre un objeto de la base de datos. En otras palabras, es lo que permite controlar los privilegios en la Base de Datos. Los comandos asociados al control de datos son: GRANT y REVOKE :

## Lenguaje de Control de Datos (DCL): GRANT

- `GRANT CREATE TABLE TO username`

- `GRANT DROP ANY TABLE TO username`

## Lenguaje de Control de Datos (DCL): REVOKE

- Para revocar los privilegios que tiene un usuario sobre una tabla:

- `REVOKE CREATE TABLE TO username`

## Expresiones de Búsqueda selectiva: LIKE

La cláusula LIKE se usa en las consultas de SQL conjuntamente con la cláusula WHERE como parte de la condición a cumplir, comparando datos extraídos de la tabla con una expresión que contiene comodines o caracteres especiales  
(como ‘%’ y ‘_’).

En ella:
- El símbolo de porcentaje (%) representa ninguno, uno o más caracteres.
- El símbolo de guion bajo (_) representa un solo carácter.

Considere los siguientes datos de la tabla pasajeros:

In [22]:
%%sql 
DROP TABLE IF EXISTS pasajeros

 * sqlite:///flights.db
Done.

[]

- Crear tabla pasajeros

In [23]:
%%sql sqlite:// 

CREATE TABLE pasajeros (
    id_pasajero SERIAL AUTO INCREMENT PRIMARY KEY,  
    pasaporte VARCHAR,
    apellido VARCHAR,
    nombre VARCHAR
)

Done.

[]

- Poblar con datos tabla pasajeros

In [24]:
%%sql
INSERT INTO pasajeros (id_pasajero, pasaporte, apellido, nombre) VALUES
    (1, '06678450', 'gavidia', 'liliana'),
    (2, '32775484', 'jimenez', 'jose'),
    (3, '02115537', 'ceballos', 'olga'),
    (4, '15978124', 'britto', 'arantxa'),
    (5, '21447895', 'perez', 'pedro'),
    (6, '82139600', 'gonzalez', 'judith'),
    (7, '12115432', 'collado', 'coral'),
    (8, '98347021', 'farkas', 'eduardo'),
    (9, '12115432', 'rodriguez', 'loly'),
    (10, '49718225', 'ruiz', 'hernando'),
    (11, '21716470', 'marquez', 'alejandro')

 * sqlite:///flights.db
11 rows affected.

[]

In [39]:
%sql select * from pasajeros

 * sqlite:///flights.db
Done.

[(1, '06678450', 'gavidia', 'liliana'),
 (2, '32775484', 'jimenez', 'jose'),
 (3, '02115537', 'ceballos', 'olga'),
 (4, '15978124', 'britto', 'arantxa'),
 (5, '21447895', 'perez', 'pedro'),
 (6, '82139600', 'gonzalez', 'judith'),
 (7, '12115432', 'collado', 'coral'),
 (8, '98347021', 'farkas', 'eduardo'),
 (9, '12115432', 'rodriguez', 'loly'),
 (10, '49718225', 'ruiz', 'hernando'),
 (11, '21716470', 'marquez', 'alejandro')]

## Expresiones de Búsqueda selectiva: LIKE

- Consulta de todos los registros cuyo nombre **comienza** por una ‘j’:

In [25]:
%%sql SELECT * FROM pasajeros
    WHERE nombre LIKE 'j%'

 * sqlite:///flights.db
Done.

[(2, '32775484', 'jimenez', 'jose'), (6, '82139600', 'gonzalez', 'judith')]

- Consulta de todos los registros cuyo nombre **finaliza** con una ‘a’:

In [26]:
%%sql SELECT * FROM pasajeros
    WHERE nombre LIKE '%a'

 * sqlite:///flights.db
Done.

[(1, '06678450', 'gavidia', 'liliana'),
 (3, '02115537', 'ceballos', 'olga'),
 (4, '15978124', 'britto', 'arantxa')]

- Consulta de todos los registros cuyo nombre tiene una **‘o’ en la segunda posición** de los caracteres:

In [27]:
%%sql SELECT * FROM pasajeros
    WHERE nombre LIKE '_o%'

 * sqlite:///flights.db
Done.

[(2, '32775484', 'jimenez', 'jose'),
 (7, '12115432', 'collado', 'coral'),
 (9, '12115432', 'rodriguez', 'loly')]

## Funciones de agregación : SUM, MAX

- La función SUM () retorna la suma total de una columna numérica.

 - `SELECT SUM (nombre_columna)  
      FROM nombre_tabla  
      WHERE  condicion`

- La función MAX () devuelve el valor máximo en la columna especificada.

- `SELECT MAX (nombre_columna)  
     FROM nombre_tabla  
     WHERE  condicion`

## Funciones de agregación : MIN, COUNT

- La función MIN () devuelve el valor mínimo en la columna especificada.

- `SELECT MIN (nombre_columna)  
     FROM nombre_tabla  
     WHERE  condicion`

- La función COUNT () retorna el número de filas que cumplen con la condición especificada.

- `SELECT COUNT (nombre_columna)  
     FROM nombre_tabla  
     WHERE  condicion`

## Funciones de agregación : AVG

- La función AVG () retorna el valor promedio de un columna numérica.

- `SELECT AVG (nombre_columna)  
     FROM nombre_tabla  
     WHERE  condicion`

## Funciones de agrupación : GROUP BY

- La cláusula GROUP BY permite agrupar los resultados de una consulta SELECT 
según una o más columnas. 
- Suele usarse a menudo con las funciones de agregación 
(SUM, MAX, MIN, COUNT, AVG) para agrupar el conjunto de 
resultados por una o más columnas.

- `SELECT nombre_columna funcion(nombre_columna)  
     FROM nombre_tabla  
     WHERE  condicion  
     GROUP BY nombre_columna`

- Supongamos que tenemos una tabla tarjeta_embarque con los siguientes campos:

In [28]:
%%sql
DROP TABLE IF EXISTS tarjeta_embarque;

 * sqlite:///flights.db
Done.

[]

In [29]:
%%sql sqlite:// 

CREATE TABLE tarjeta_embarque (
    id_tarjeta_embarque SERIAL AUTO INCREMENT,  
    id_pasajero TEXT,
    nro_vuelo TEXT,
    nacionalidad_pasajero TEXT,
    fecha_vuelo TEXT,
    clase TEXT,
    asiento TEXT,
    sala_embarque TEXT
)

Done.

[]

In [30]:
%sql SELECT * FROM tarjeta_embarque

 * sqlite:///flights.db
Done.

[]

In [31]:
%%sql
INSERT INTO tarjeta_embarque (id_tarjeta_embarque, id_pasajero, nro_vuelo, nacionalidad_pasajero, 
    fecha_vuelo, clase, asiento, sala_embarque) VALUES
    (102030, '1', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '3A', '24'),
    (102040, '2', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '4A', '24'),
    (102050, '3', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '4B', '24'),
    (102060, '4', 'IB6674', 'estadounidense', '26 oct', 'turista', '14A', '24'),
    (102070, '5', 'IB6674', 'estadounidense', '26 oct', 'turista', '16A', '24'),
    (102080, '6', 'IB6674', 'estadounidense', '26 oct', 'turista', '24A', '24'),
    (102090, '7', 'IB6674', 'estadounidense', '26 oct', 'turista', '20A', '24'),
    (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '14C', '24'),
    (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '25B', '24'),
    (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '14D', '24')

 * sqlite:///flights.db
10 rows affected.

[]

In [30]:
%sql SELECT * FROM tarjeta_embarque

 * sqlite:///flights.db
Done.

[(102030, '1', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '3A', '24'),
 (102040, '2', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '4A', '24'),
 (102050, '3', 'IB6674', 'venezolana', '26 oct', 'ejecutiva', '4B', '24'),
 (102060, '4', 'IB6674', 'estadounidense', '26 oct', 'turista', '14A', '24'),
 (102070, '5', 'IB6674', 'estadounidense', '26 oct', 'turista', '16A', '24'),
 (102080, '6', 'IB6674', 'estadounidense', '26 oct', 'turista', '24A', '24'),
 (102090, '7', 'IB6674', 'estadounidense', '26 oct', 'turista', '20A', '24'),
 (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '14C', '24'),
 (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '25B', '24'),
 (103030, '6', 'IB6674', 'española', '26 oct', 'turista', '14D', '24')]

- Si queremos conocer el número de pasajeros según su nacionalidad en el vuelo IB6674:

In [44]:
%%sql SELECT COUNT(id_pasajero), nacionalidad_pasajero  
    FROM tarjeta_embarque  
    WHERE nro_vuelo LIKE'IB%'  
    GROUP BY nacionalidad_pasajero

 * sqlite:///flights.db
Done.

[(3, 'española'), (4, 'estadounidense'), (3, 'venezolana')]

## Funciones de ordenamiento: ORDER BY

- Especifica la forma de ordenar los resultados. 
- Esta cláusula se coloca de último en la instrucción SQL y contiene una lista de los campos usados para ordenar, en el mismo orden en el que se quiere aplicar los criterios para ordenar los resultados de la consulta SQL.
- Si se desea ordenar los resultados de una consulta de vuelos disponibles cuyo origen sea caracas y cuyo destino sea Miami por aerolínea en orden ascendente, y en caso que haya varios vuelos para una misma aerolínea, se desea también ordenarlos por hora de salida del vuelo en forma ascendente, la cláusula ORDER BY a incluir al final de la instrucción sería la siguiente:

In [45]:
%%sql
    DROP TABLE IF EXISTS vuelos

 * sqlite:///flights.db
Done.

[]

In [46]:
%%sql sqlite:// 

CREATE TABLE vuelos (
    id_vuelo SERIAL AUTO INCREMENT,  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

Done.

[]

In [47]:
%%sql
INSERT INTO vuelos (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
    ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

 * sqlite:///flights.db
8 rows affected.

[]

In [48]:
%%sql SELECT * FROM vuelos  
    WHERE origen='new york' AND destino='miami'
    ORDER BY aerolinea, hora_salida

 * sqlite:///flights.db
Done.

[('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
 ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
 ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')]

## Expresiones avanzadas: INDICES

- Un índice es una estructura de almacenamiento físico empleada para acelerar el procesamiento de las consultas y por ende el acceso a los datos.
- Un índice acelera las búsquedas por un subconjunto de campos de interés y que no incluya la clave primaria (índice primario).

- Supongamos por ejemplo que se desea ubicar una palabra específica en un libro que no tiene índice.
- En ese caso habría que ir página por página, y palabra por palabra para ubicar la palabra que se está consultando. 
- Si se dispone de un índice, simplemente se va al índice, se ubica la palabra que se está buscando, y simplemente se va al número de página correspondiente. 
- Adicionalmente, cabe destacar que en un índice, las palabras están guardadas en orden alfabético. 
- De esta manera, ubicar la palabra en el índice es más rápido. 
- De allí la idea de utilizar índices, para hacer las consultas de manera rápida y eficiente.

## Estructura de un Disco Duro

- El disco consta de varios platos, cada uno con un cabezal de aguja
- Los círculos concéntricos se denominan **pistas** (*tracks*)
- La intersección etre un **sector** y dos pistas contiguas se senomina **bloque** (área naranja)

<img src='img/sql/spindle_hd.png' width='380' align='left'> <img src='img/sql/sector_hd_block.png' width='300'>

- Es posible especificar cualquier posición en el disco indicando:
    - Número de **pista** (*track*)
    - Número de **sector**
- *Block address* = (**track**_number, **sector**_number)
- El bloque puede ser de cualquier tamaño (512 bytes, etc.)
- La lectura/escritura se realiza en términos de bloques
- Cada byte se ubica especificando el *offset*
    - *(Block address*, *offset)*
- Al rotar el plato se fija el **sector**
- Con el movimiento de la aguja se fija la **pista** (*track*)
- Los sistemas de Gestión de Bases de Datos (DBMS) permiten almacenar los datos de manera eficiente en el disco

## Ejemplo de búsqueda optmizada. Carta en una pila

- Búsqueda en pila aleatoria de 52 cartas.

<img src= 'img/indexing/queen_hearts.png' width= '65' height= '30' align='left' style="vertical-align:middle;margin:0px 40px">
<img src= 'img/indexing/card_deck.png' width= '80' style="vertical-align:middle;margin:0px 195px">
<left width= '80' style="vertical-align:middle;margin:0px 250px"> En promedio 26 lanzamientos</left>

- Búsqueda aleatoria en cuatro pilas con cartas agrupadas por pintas.
    - 4 pilas: 2 lanzamientos
    - 13 cartas: 7 lanzamientos

<img src= 'img/indexing/4pile_cards.png' width= '280'>
<center> En promedio 9 lanzamientos </center>

- Búsqueda en la que cada pinta se separa adicionalmente en dos grupos: (As hasta, 6 y 7 hasta Rey)
    - 4 pilas: 2 lanzamientos
    - 2 pilas: 1 lanzamiento
    - 7 cartas: 4 lanzamientos

- Al reagrupar los datos en pilas con ciertas claves, es posible reducir drásticamente el número de búsquedas y selecciones requeridas para el acceso a los datos

## Búsqueda en Bloques

- Supongamos que tenemos 100 registros en la tabla pasajeros.
- Cada registro ocupa 128 bytes.
- Si se definen bloques de almacenamiento en el disco duro de 512 bytes:
    - Es posible almacenar 4 registros por bloque.
    - Se requieren 25 bloques para almacenar los 100 registros.
    - Se requieren 25 accesos al disco duro para recorrer todos los registros.

<img src= 'img/sql/data_blocks.png' width= '540'>

#### Cómo disminuimos el número de accesos al disco duro?
- Definiendo índices.
    - Se define un índice que apunta a cada registro de la tabla pasajeros (indicando el bloque de cada registro).
    - Supongamos que el índice ocupa 16 bytes entre el id_pasajero y el apuntador a cada registro correspondiente.
    - 512/16 = 32. Cada bloque puede almacenar la información de los apuntadores a 32 registros. 
    - Se requieren 4 bloques para almacenar el índice de los 100 registros.
- Cada vez que se desea realizar una búsqueda se ubica el índice, y con este se apunta al bloque que contiene el registro en cuestión.
    - Para ubicar el índice se requiere recorrer 4 bloques.
    - Una vez ubicado el índice se requiere recorrer un bloque para ubicar el registro en cuestión.
    - En total: 5 bloques (4 bloques de índice y 1 bloque de la tabla pasajeros).
    - 5 accesos al disco duro.

## Índices Multi-nivel 
(*Multi-level Index*)

- Otro ejemplo:
    - 1000 registros en lugar de 100.
    - 40 bloques de índice.
    - Se crea un índice para los bloques de índice.
    - Un índice por bloque, es decir un índice por cada 32 entradas de índice.
    - 2 bloques para almacenar el índice de alto nivel (1 con 32 entradas y otro con 8).
    - 2 bloques para el índice de alto nivel. Ese apunta a 1 bloque del índice, y ese a su vez a un bloque de la tabla pasajeros.  En total: 4 accesos al disco duro.
    - Al añadir un nivel de índice adicional se reduce drásticamente el número de accesos al disco duro.

## Árbol Binario de Búsqueda
(*Binary Search Tree*)

- Es un tipo especial de árbol binario con la siguiente propiedad:
    - Todos los elementos almacenados en el subárbol izquierdo de cualquier nodo x son menores que el elemento almacenado en x
    - Todos los elementos almacenados en el subárbol derecho de x son mayores que el elemento almacenado en x
- En otras palabras:
    - Todos los elementos en su subárbol izquierdo son menores al nodo (<)
    - Todos los elementos en su subárbol derecho son mayores que el nodo (>).

<img src= 'img/sql/binarysearch_tree.png' width= '260'>

## Árbol de Búsqueda de M Vias
(M-Way Search Tree)

- Un árbol m-way es una estructura de árbol que tiene m valores y m + 1 enlaces.

- Un árbol binario es un caso especial de un árbol m-way con mun valor igual a uno, lo que significa que solo hay un valor por nodo y dos enlaces (o se mueve hacia abajo al enlace izquierdo o derecho).

<img src= 'img/sql/mway_tree.png' width= '460'>

## Expresiones avanzadas: RESTRICCIONES

- Las restricciones son reglas para limitar el tipo de datos que puede ingresarse en una tabla, a fin de mantener la integridad de los datos en la tabla.
- Principales restricciones que pueden ser añadidas a la tabla:

- **NOT NULL**: Establece que la columna siempre debe tener un valor adecuado, que no puede ser nulo.

In [ ]:
%%sql
DROP TABLE IF EXISTS prueba;

In [ ]:
%%sql sqlite:// 

CREATE TABLE prueba (
    id_vuelo INT,  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

In [ ]:
%sql pragma table_info(prueba)

In [ ]:
%%sql
INSERT INTO prueba (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
    ('IB6674', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

- **UNIQUE**, la cual asegura que la columna solo tomará valores únicos y que no habrá valores repetidos.

In [ ]:
%%sql
DROP TABLE IF EXISTS prueba;

In [ ]:
%%sql sqlite:// 

CREATE TABLE prueba (
    id_vuelo INT UNIQUE,  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

In [ ]:
%%sql
INSERT INTO prueba (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
    ('TK1836', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

In [ ]:
%sql SELECT * FROM prueba

- **PRIMARY KEY**, la cual asegura que cada registro pueda ser identificado de manera única. La clave primaria debe tomar un valor único y no puede tomar el valor NULL.

In [ ]:
%%sql
DROP TABLE IF EXISTS prueba;

In [ ]:
%%sql sqlite:// 

CREATE TABLE prueba (
    id_vuelo INT PRIMARY KEY,  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

In [ ]:
# Cambiar id_vuelo en la segunda fila de IB6674 a TK1836
# Esto evita error por no cumplir con la característica UNIQUE del PRIMARY KEY

In [ ]:
%%sql
INSERT INTO prueba (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
    ('IB6674, 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

In [ ]:
%sql SELECT * FROM prueba

- **CHECK**, se usa para limitar el rango de valores posibles de una columna de la tabla. 
- Realiza comprobaciones de los valores, antes de ser guardados en la base de datos.

In [ ]:
%%sql
DROP TABLE IF EXISTS prueba;

In [ ]:
%%sql sqlite:// 

CREATE TABLE prueba (
    id_vuelo INT PRIMARY KEY CHECK(id_vuelo>0),  
    origen VARCHAR NOT NULL,
    destino VARCHAR NOT NULL,
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

In [ ]:
# Cambiar id_vuelo en la segunda fila de -1 a TK1836
# Esto evita error por no cumplir con la característica >0 impuesta con CHECK(id_vuelo>0)

In [ ]:
%%sql
INSERT INTO prueba (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', 'madrid', '19:50', '10:15', 'iberia'),
    ('-1', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

- **DEFAULT**, usada para asignar un valor por defecto en una columna de la tabla!

In [ ]:
%%sql
DROP TABLE IF EXISTS prueba;

In [ ]:
%%sql sqlite:// 

CREATE TABLE prueba (
    id_vuelo INT PRIMARY KEY CHECK(id_vuelo>0),  
    origen VARCHAR NOT NULL,
    destino VARCHAR DEFAULT 'madrid',
    hora_salida TEXT,
    hora_llegada TEXT,
    aerolinea VARCHAR NOT NULL
)

In [ ]:
%sql pragma table_info(prueba)

In [ ]:
# TK1836

In [ ]:
%%sql
INSERT INTO prueba (id_vuelo, origen, destino, hora_salida, hora_llegada, aerolinea) VALUES
    ('IB6674', 'caracas', '', '19:50', '10:15', 'iberia'),
    ('TK1736', 'barcelona', 'estambul', '13:15', '17:40', 'turkish airlines'),
    ('LH0920', 'francfort', 'londres', '20:00', '20:40', 'lufthansa'),
    ('LX0633', 'paris', 'zurich', '9:50', '11:10', 'swiss'),
    ('AA5823', 'dallas', 'beijing', '11:20', '14:15', 'american airlines'),
    ('AA1141', 'new york', 'miami', '5:40', '9:30', 'american airlines'),
    ('DL1301', 'new york', 'miami', '19:30', '10:45', 'delta'),
    ('B64044', 'new york', 'miami', '18:20', '21:30', 'jet blue')

In [ ]:
%sql SELECT * FROM prueba

- **FOREIGN KEY**, la cual se usa para relacionar dos tablas.
- Las claves foráneas son primarias en otras tablas.

In [ ]:
%sql SELECT * FROM vuelos

In [ ]:
%sql SELECT * FROM pasajeros

In [43]:
%%sql
DROP TABLE IF EXISTS t_embarque;

 * sqlite:///flights.db
Done.

[]

In [44]:
%%sql sqlite:// 

CREATE TABLE t_embarque (
    id_vuelo INT FK,  
    id_pasajero INT FK,
    fecha_salida TEXT
)

Done.

[]

In [45]:
%%sql
INSERT INTO t_embarque (id_vuelo, id_pasajero, fecha_salida) VALUES
    ('IB6674', '1', '06/06/2021'),
    ('IB6674', '2', '06/06/2021'),
    ('IB6674', '3', '06/06/2021'),
    ('TK1836', '4', '16/06/2021'),
    ('LH0920', '5', '12/03/2021'),
    ('LX0633', '6', '20/04/2021'),
    ('AA5823', '7', '26/10/2021')

 * sqlite:///flights.db
7 rows affected.

[]

In [46]:
%sql SELECT * FROM t_embarque

 * sqlite:///flights.db
Done.

[('IB6674', 1, '06/06/2021'),
 ('IB6674', 2, '06/06/2021'),
 ('IB6674', 3, '06/06/2021'),
 ('TK1836', 4, '16/06/2021'),
 ('LH0920', 5, '12/03/2021'),
 ('LX0633', 6, '20/04/2021'),
 ('AA5823', 7, '26/10/2021')]

- Unión de dos tablas en una sola,a nivel horizontal, usando **JOIN**

In [47]:
%%sql SELECT pasajeros.id_pasajero, pasajeros.pasaporte, pasajeros.apellido, pasajeros.nombre, 
    t_embarque.id_vuelo, t_embarque.fecha_salida FROM pasajeros INNER JOIN 
    t_embarque ON pasajeros.id_pasajero = t_embarque.id_pasajero

 * sqlite:///flights.db
Done.

[(1, '06678450', 'gavidia', 'liliana', 'IB6674', '06/06/2021'),
 (2, '32775484', 'jimenez', 'jose', 'IB6674', '06/06/2021'),
 (3, '02115537', 'ceballos', 'olga', 'IB6674', '06/06/2021'),
 (4, '15978124', 'britto', 'arantxa', 'TK1836', '16/06/2021'),
 (5, '21447895', 'perez', 'pedro', 'LH0920', '12/03/2021'),
 (6, '82139600', 'gonzalez', 'judith', 'LX0633', '20/04/2021'),
 (7, '12115432', 'collado', 'coral', 'AA5823', '26/10/2021')]

## Expresiones avanzadas: UNIONES

- El comando JOIN permite combinar información de dos o más tablas, que se juntan para permitir presentar la información como si fuera un solo conjunto de datos. 
- Para unirlas se usan valores comunes en ambas tablas.

<img src="img/sql/sql_join.png" width="560">

## CROSS JOIN

<img src='img/sql/cross_join.png' width= '400'>

- CROSS JOIN o Producto Cartesiano: Retorna el producto cartesiano de las filas de las tablas especificadas en la instrucción JOIN. 
- El resultado es una tabla que combina una a una cada fila de la primera tabla con cada fila de la segunda.
- En la tabla tarjeta-embarque, si queremos obtener la información del pasajero, debemos combinar la información de las dos tablas, a través del atributo común id-pasajero.

- ``SELECT lista_nombres_columna FROM nombre_tabla1 CROSS JOIN nombre_tabla2``

In [ ]:
%%sql SELECT * FROM pasajeros CROSS JOIN t_embarque

## INNER JOIN

<img src='img/sql/inner_join.png' width= '345'>

- INNER JOIN, que retorna como resultado una tabla que combina las fias de la primera tabla con las filas de la segunda según se cumpla la condición de igualdad especificada en la cláusula del comando.

- `SELECT lista_nombres_columna FROM nombre_tabla1
     INNER JOIN nombre_tabla2
     WHERE nombre_tabla1.nombre_columna=nombre_tabla2`

In [ ]:
%%sql SELECT * FROM pasajeros INNER JOIN 
    t_embarque WHERE pasajeros.id_pasajero = t_embarque.id_pasajero

## LEFT JOIN

<img src='img/sql/left_join.png' width= '340'>

- LEFT JOIN, que retorna como resultado una tabla que combina todas las filas de la primera y la segunda tabla que cumplan la condición especificada en la cláusula del comando, seguida del resto de filas de la primera tabla y NULL como valor del resto de filas de la segunda tabla.

- `SELECT lista_nombres_columna FROM nombre_tabla1
     LEFT JOIN nombre_tabla2
     ON nombre_tabla1.nombre_columna=nombre_tabla2`

In [ ]:
%%sql SELECT * FROM pasajeros LEFT JOIN 
    t_embarque ON pasajeros.id_pasajero = t_embarque.id_pasajero

## RIGHT JOIN

<img src='img/sql/right_join.png' width= '340'>

- RIGHT JOIN, que retorna como resultado una tabla que combina todas las filas de la primera y la segunda tabla que cumplan la condición especificada en la cláusula del comando, seguida de NULL como valor del resto de filas de la primera tabla y el resto de filas de la segunda tabla.

- `SELECT lista_nombres_columna FROM nombre_tabla1
     RIGHT JOIN nombre_tabla2
     ON nombre_tabla1.nombre_columna=nombre_tabla2`

In [ ]:
%%sql SELECT * FROM pasajeros RIGHT JOIN 
    t_embarque ON pasajeros.id_pasajero = t_embarque.id_pasajero

## FULL OUTER JOIN

<img src='img/sql/outer_join.png' width= '340'>

- FULL OUTER JOIN, que retorna como resultado una tabla que combina todas las filas de la primera y la segunda tabla que cumplan la condición especificada en la cláusula del comando, seguida del resto de filas de la primera y la segunda tabla.

- `SELECT lista_nombres_columna FROM nombre_tabla1
     FULL OUTER JOIN nombre_tabla2
     ON nombre_tabla1.nombre_columna=nombre_tabla2`

In [ ]:
%%sql SELECT * FROM pasajeros FULL OUTER JOIN 
    t_embarque ON pasajeros.id_pasajero = t_embarque.id_pasajero

## Modelo de Datos Tienda de Mascotas Love4Pets

- Para su creación, se siguieron paso a paso las recomendaciones de las formas de normalización, a fin de eliminar información redundante, y de garantizar la integridad de los datos y su escalabilidad.

<img src="img/sql/modelo_datos_love4pets.png" width="460">

- En él muestran las entidades, que aparecen resaltadas en color encabezando la tabla, junto con sus respectivos atributos, así como relaciones uno a uno y uno a muchos entre las tablas.

- A partir de él se crea la base de datos de la actividad (Manipulación de Datos con SQL)

In [ ]:
import datetime

In [ ]:
datetime.datetime(2021,6,23,18,15)